jdash/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`company`, `eventname`, `systemname`, `apptype`, `eventstatus`, `clustername`, `archived`, `startdate`, `enddate`, `created_at`, `updated_at`) VALUES ('cisco', 'Cisco Live2015', 'cisco:ciscolive2015', 'AST', 'Active', 'app100', 0, '2015-07-07 19:38:00', '2015-07-07 19:38:00', '2015-07-07 19:39:39', '2015-07-07 19:39:39')

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE `events` SET `apptype` = 'mst_2', `updated_at` = '2015-07-08 06:30:05' WHERE `events`.`id` = 2

  def destroy
    @event.destroy
---
DELETE FROM `events` WHERE `events`.`id` = 3

    def set_event
      @event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 3 LIMIT 1